docs/posts/2010-04-18-visit-to-ft-moultrie.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 30, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Visit to Ft. Moultrie</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Visit to Ft. Moultrie</h1>
<p class="subtitle" role="doc-subtitle">Apr 18, 2010</p>
</header><p>
Yesterday, my class at the chaplain school participated in a staff ride to Charleston. &ldquo;Staff ride&rdquo; sounds more impressive than &ldquo;field trip&rdquo; but they mean the same thing. The highlight of the visit was a trip to Ft. Moultrie on Sullivan&rsquo;s Island. The defense of the fort in 1776 was the first major victory over the British in the Revolutionary War. Standing on the high ground at Ft. Moultrie, you can look straight across the harbor and see Ft. Sumter. The attack on Ft. Sumter on April 12, 1861 marks the beginning of armed conflict in the American Civil War. Then, if you scan to the left, you can see Morris Island, which is the site of Ft. Wagner. On July 18, 1863, the 54th Massachusetts assaulted Ft. Wagner, an event portrayed in the movie <i>Glory</i>. There, Sergeant William H. Carney secured the United States flag as the color-bearer fell, the first action for which an African-American would be awarded the Congressional Medal of Honor.
</p>

<p>
It&rsquo;s a moving experience to see a century of history and heroism from one spot on the South Carolina coast.
</p>


<div class="tagline" id="org13be275">
<p>
Tagged: <a href="../tags/army.html">Army</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 30, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
